<!-- frontend/src/routes/insight/+page.svelte -->

<div class="w-full max-w-[1100px] h-auto relative mx-auto p-4 flex flex-col md:flex-row">
	<div class="md:w-2/3 w-full">
		<div class="text-2xl font-semibold mb-2">
			공연 취소에 영향을 미치는
			<span class="text-[#696969]"></span>
			<span class="text-[#696969]"> 요인 </span>
		</div>
		<div
			class="text-black text-[3vw] md:text-xl font-normal font-['Oxygen'] leading-[1.5em] mt-4"
		></div>
	</div>
</div>

공연 일반에 대한 취소 분석 취소 vs 장르 (공연의 장르가 취소수에 얼마나 영향을 미칠까?) 뮤지컬
Musical, 대중음악 Pop Music, 연극 Play, 서양음악(클래식) Western Music (Classical),
무용(서양/한국무용) Dance (Western/Korean), 한국음악(국악) Korean Music (Traditional), 서커스/마술
Circus/Magic, 복합 Mixed, 대중무용 Pop Dance 뮤지컬 장르가 가장 많음, 대중무용의 경우 장르자체의
숫자에 비해 취소율이 높은 부분을 확인할 수 있었다 취소 vs 시설특성 민간(대학로 외) Private (Outside
Daehak-ro), 민간(대학로) Private (Daehak-ro), 공공(문예회관) Public (Cultural Center),
기타(비공연장) Other (Non-Performance Venue), 공공(기타) Public (Other), 국립 National
민간(대학로)가 가장 공연이 많았고 취소율도 높음, 공공(문예회관)의 경우 공연수가 많지만 취소율이
상대적으로 낮음, 취소율의 경우는 크게 차이가 없는 것으로 봤을 때, 시설특성은 취소율에 큰 영향을
미치지 않는 것으로 판단할 수 있음 취소 vs 공연지역명 서울이 역시 공연수가 압도적으로 많은 것을
확인할 수 있었음, 취소율은 대동소이 하고, 제주도의 경우가 비율상 가장 낮았음, 서울은 공연수가 많은
만큼 취소율도 높음 취소 vs 결제수단, 장당금액? 기타 Other, 카드 Card, 현금 Cash, 다중결제 Multiple
Payment, 무통장 Bank Transfer, 상품권 Gift Certificate 카드로 결제하는 경우가 과반수 이상, 상품권
결제의 경우는 취소율이 15%까지 떨어지는 모습이고 다중결제 및 현금의 경우 취소율이 높은 편 취소 vs
할인종류, 할인금액? 기타 Other, 자체할인 In-house Discount, 미적용 No Discount, 신용카드사 Credit
Card Company, 다중할인 Multiple Discounts 할인종류는 대부분 기타로 분류되어서 데이터의 신뢰성이
낮음, 신용카드사로 할인을 받은 경우는 취소율이 0%로 나타남, 취소 vs 아동공연 여부 아동 공연이 아닌
경우가 대부분이고, 아동공연인 경우 취소율이 5%정도 낮음 취소 vs 날씨(기온, 기상현상) 취소 vs
공연일시 가장 자료가 많은 서울을 기준으로 공연일시 및 날씨별 최소수가 어떻게 되는지 확인(날짜는
공공데이터 API에서 가져올 수 있음) 여기서 얻은 인사이트를 바탕으로 시간대별 취소율과 날씨별 취소율을
확인(서울지역 기준) 시간대 자체는 14시나 19시 공연이 가장 많은 부분을 확인할 수 있고, 취소율에서는
대동소이하나, 14공연이 취소율이 높은편 날씨는 맑은 날씨와 비오는 날씨가 비슷하고, 취소율과는 거의
영향이 없는 부분 확인 가능, 눈이 올 때만 약간 취소율이 상승하는편 취소 vs 성별 특정 성별을 확인할 수
없도록 성별은 0과 1, 2로만 표기되어 있었고, gender가 0인 경우와 2인 경우가 많았음, 취소율도 거의
비슷한 수치를 보임 가장 적은 데이터를 가진 Gender1의 경우가 취소율이 낮은 편 취소 vs 연령 연령은
이상치를 제거하고 iqr을 기준으로 1.5가 아닌 factor를 3으로 골라서 이상치를 제거했음, 그러면
0~89살까지의 데이터가 남게되는데 그 연령별 취소율을 계산할 수 있었음, 20대 후반 부터 40대 초반까지
공연을 확실히 많이 보는 경향을 확인할 수 있고, 취소율은 25%정도로 나타남 연령대가 극단적으로
높아지거나 낮아지는 경우는 취소율이 안정적이지 않고 변화가 큼 취소 vs 개관연도 오래된 개관연도는
취소율이 높을수 있지 않을까 가능성을 보려고 했지만 취소율에 있어서 그렇게 큰 연관은 없었음. 1997년에
개관한 어떤 곳은 취소율이 5%정도로 낮은 것을 확인할 수 있음 어디인지 확인해봤는데 취소 vs 할인금액
할인금액은 0원인 경우가 압도적으로 많고, 이상치를 제거하고 할인금액에 대한 취소율을 확인해봤을 때,
크진 않지만 할인금액이 커지면 취소율도 낮아지는 경향이 있음을 확인할 수 있음 취소 vs 장당금액 10만원
이상의 경우 그래프의 움직임이 커지는 모습을 보이지만 전체적으로는 장당금액이 높아질 수록 취소율도
높아지는 경향을 보임 PF343804(옥탑방 고양이) 공연에 대한 취소수 예측 분석 공연일반에 대한 분석을
마쳤고, 이번에는 공연 주최측에서 서비스를 쓴다고 가정했을 때, 특정 공연코드에 대해서 취소수를
예측하기 이해서 어떻게 특성을 골라낼 수 있을지 고민해보았음
